<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head>
    <meta charset="utf-8">
<title>技術菜菜 2020 在幹嘛？2021 要幹嘛？ - Chih Yang&#39;s Blog</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">




<meta name="description" content="Chih Yang 的前端小天地">



<meta name="keywords" content="前端">



    <meta name="description" content="&amp;#x524D;&amp;#x8A00;2020 &amp;#x95DC;&amp;#x65BC;&amp;#x5BEB;&amp;#x6587;&amp;#x7AE0;&amp;#x7684;&amp;#x56DE;&amp;#x9867;&amp;#xFF0C;&amp;#x4EE5;&amp;#x53CA; 2021 &amp;#x7684;&amp;#x8A31;&amp;#x9858;&amp;#x548C;&amp;#x898F;&amp;#x5283;&amp;#xFF0C;&amp;#x8B9A;&amp;#x5587;&amp;#x3002;">
<meta property="og:type" content="article">
<meta property="og:title" content="技術菜菜 2020 在幹嘛？2021 要幹嘛？">
<meta property="og:url" content="https://chihyang41.github.io/2021/01/02/2020-review/index.html">
<meta property="og:site_name" content="Chih Yang&#39;s Blog">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;2020 &amp;#x95DC;&amp;#x65BC;&amp;#x5BEB;&amp;#x6587;&amp;#x7AE0;&amp;#x7684;&amp;#x56DE;&amp;#x9867;&amp;#xFF0C;&amp;#x4EE5;&amp;#x53CA; 2021 &amp;#x7684;&amp;#x8A31;&amp;#x9858;&amp;#x548C;&amp;#x898F;&amp;#x5283;&amp;#xFF0C;&amp;#x8B9A;&amp;#x5587;&amp;#x3002;">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2021-01-02T10:22:56.000Z">
<meta property="article:modified_time" content="2021-01-02T10:31:21.994Z">
<meta property="article:author" content="Chih Yang">
<meta property="article:tag" content="廢文日記">
<meta name="twitter:card" content="summary">





<link rel="icon" href="https://upload.cc/i1/2020/03/05/MXS6WH.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-dark.min.css">


<link rel="stylesheet" href="/css/style.css">


<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    
<script async src="https://www.googletagmanager.com/gtag/js?id=UA-146838618-1"></script>
<script>
    window.dataLayer = window.dataLayer || [];
    function gtag(){dataLayer.push(arguments);}
    gtag('js', new Date());

    gtag('config', 'UA-146838618-1');
</script>


    


<meta name="generator" content="Hexo 4.2.0"></head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                    
                    Chih Yang&#39;s Blog
                    
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item "
               href="/archives">Archives</a>
            
            <a class="navbar-item "
               href="/tags">Tags</a>
            
            <a class="navbar-item "
               href="/categories">Categories</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="Search" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ChihYang41" target="_blank" rel="noopener">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            技術菜菜 2020 在幹嘛？2021 要幹嘛？
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2021-01-02T10:22:56.000Z" itemprop="datePublished">Jan 2 2021</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/%E9%9B%9C%E8%A8%98/">雜記</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            20 minutes read (About 2986 words)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <html><head></head><body><h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><p>2020 &#x95DC;&#x65BC;&#x5BEB;&#x6587;&#x7AE0;&#x7684;&#x56DE;&#x9867;&#xFF0C;&#x4EE5;&#x53CA; 2021 &#x7684;&#x8A31;&#x9858;&#x548C;&#x898F;&#x5283;&#xFF0C;&#x8B9A;&#x5587;&#x3002;</p>
<a id="more"></a>

<h2 id="&#x95DC;&#x65BC;-Blog&#xFF0C;&#x95DC;&#x65BC;&#x5BEB;&#x6587;"><a href="#&#x95DC;&#x65BC;-Blog&#xFF0C;&#x95DC;&#x65BC;&#x5BEB;&#x6587;" class="headerlink" title="&#x95DC;&#x65BC; Blog&#xFF0C;&#x95DC;&#x65BC;&#x5BEB;&#x6587;"></a>&#x95DC;&#x65BC; Blog&#xFF0C;&#x95DC;&#x65BC;&#x5BEB;&#x6587;</h2><h3 id="2020-&#x6478;&#x7D22;&#x5BEB;&#x4F5C;"><a href="#2020-&#x6478;&#x7D22;&#x5BEB;&#x4F5C;" class="headerlink" title="2020 - &#x6478;&#x7D22;&#x5BEB;&#x4F5C;"></a>2020 - &#x6478;&#x7D22;&#x5BEB;&#x4F5C;</h3><p>&#x5BEB;&#x6587;&#x7AE0;&#x9019;&#x4EF6;&#x4E8B;&#x662F;&#x6211;&#x5728; 2020 &#x9019;&#x5E74;&#x6478;&#x7D22;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x4EE5;&#x6574;&#x500B; 2020 &#x4F86;&#x8AAA;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x7522;&#x91CF;&#x4E0D;&#x7B97;&#x591A;&#xFF0C;&#x985E;&#x578B;&#x3001;&#x6587;&#x7AE0;&#x98A8;&#x683C;&#x3001;&#x7D50;&#x69CB;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x7D71;&#x4E00;&#x3002;</p>
<p>&#x800C;&#x6587;&#x7AE0;&#x7522;&#x51FA;&#x5C11;&#x7684;&#x539F;&#x56E0;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x591A;&#xFF1A;</p>
<p>&#x7B2C;&#x4E00;&#x662F;&#x6211;&#x9084;&#x5728;&#x6478;&#x7D22;&#x5BEB;&#x6587;&#x7AE0;&#x9019;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x4E9B;&#x6587;&#x7AE0;&#x5728;&#x5BEB;&#x7684;&#x6642;&#x5019;&#x6703;&#x6587;&#x601D;&#x6CC9;&#x6E67;&#xFF0C;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x6253;&#x5B8C;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5BEB;&#x5B8C;&#x4E4B;&#x5F8C;&#x7684;&#x98A8;&#x683C;&#x6211;&#x901A;&#x5E38;&#x6703;&#x633A;&#x6EFF;&#x610F;&#x7684;&#xFF1B;&#x53E6;&#x4E00;&#x7A2E;&#x5247;&#x662F;&#x5BEB;&#x8D77;&#x4F86;&#x5F88;&#x4E0D;&#x9806;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x5F8C;&#x767C;&#x5E03;&#x90FD;&#x9084;&#x662F;&#x89BA;&#x5F97;&#x5C11;&#x4E86;&#x9EDE;&#x751A;&#x9EBC;&#xFF0C;&#x9019;&#x7A2E;&#x6D6E;&#x52D5;&#x7684;&#x5BEB;&#x4F5C;&#x611F;&#x89BA;&#x5C0E;&#x81F4;&#x7522;&#x51FA;&#x4E0D;&#x662F;&#x5F88;&#x7A69;&#x5B9A;&#xFF1B;</p>
<p>&#x7B2C;&#x4E8C;&#x662F;&#x5C0D;&#x65BC;&#x300C;&#x6587;&#x7AE0;&#x600E;&#x6A23;&#x7B97;&#x662F;&#x53EF;&#x4EE5;&#x767C;&#x5E03;&#x300D;&#x9019;&#x4EF6;&#x4E8B;&#x9084;&#x6C92;&#x62FF;&#x500B;&#x6E96;&#xFF0C;&#x76EE;&#x524D;&#x7B46;&#x8A18;&#x5340;&#x4E5F;&#x7B97;&#x662F;&#x6709;&#x4E0D;&#x5C11;&#x7684;&#x7B46;&#x8A18;&#xFF0C;&#x53EA;&#x662F;&#x90FD;&#x9084;&#x6C92;&#x767C;&#x5230; Blog &#x4E0A;&#xFF0C;&#x56E0;&#x70BA;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x7B46;&#x8A18;&#x985E;&#x578B;&#x9019;&#x7A2E;&#x5F88;&#x53EF;&#x80FD;&#x6709;&#x932F;&#x8AA4;&#x800C;&#x4E14;&#x5F88;&#x96A8;&#x4FBF;&#x7684;&#x6587;&#x7AE0;&#x9069;&#x4E0D;&#x9069;&#x5408;&#x653E;&#x4E0A; Blog&#xFF0C;&#x96D6;&#x7136;&#x8AAA;&#x767C;&#x6587;&#x7AE0;&#x9019;&#x4EF6;&#x4E8B;&#x662F;&#x81EA;&#x5DF1;&#x723D;&#x5C31;&#x597D;&#xFF0C;&#x767C;&#x4E00;&#x5806;&#x5F88;&#x96A8;&#x4FBF;&#x7684;&#x7B46;&#x8A18;&#x4E5F;&#x6C92;&#x4EBA;&#x7BA1;&#xFF0C;&#x4F46;&#x662F;&#x5C0D;&#x65BC;&#x300C;&#x767C;&#x6587;&#x7AE0;&#x597D;&#x50CF;&#x5C31;&#x662F;&#x8981;&#x5F88;&#x597D;&#x95B1;&#x8B80;&#x3001;&#x7406;&#x89E3;&#xFF0C;&#x4E14;&#x7814;&#x7A76;&#x5FB9;&#x5E95;&#x8B93;&#x932F;&#x8AA4;&#x6700;&#x5C0F;&#x5316;&#x300D;&#x7684;&#x60F3;&#x6CD5;&#x9084;&#x662F;&#x5E38;&#x5E38;&#x63EE;&#x4E4B;&#x4E0D;&#x53BB;&#xFF0C;&#x5C0E;&#x81F4;&#x6BCF;&#x6B21;&#x90FD;&#x9700;&#x8981;&#x53CD;&#x8986;&#x659F;&#x914C;&#x5F8C;&#x624D;&#x6703;&#x767C;&#x5E03;&#x6587;&#x7AE0;&#x3002;&#xFF08;&#x4F46;&#x9019;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x6BCF;&#x7BC7;&#x6587;&#x90FD;&#x5BEB;&#x5F88;&#x597D;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x5225;&#x8AA4;&#x6703;&#xFF0C;&#x55DA;&#x55DA;&#xFF09;</p>
<p>&#x4E8B;&#x767C;&#x7E3D;&#x6709;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4F86;&#x4E0B;&#x9762;&#x5217;&#x51FA; 2020 &#x6587;&#x7AE0;&#x5927;&#x6982;&#x6709;&#x7684;&#x985E;&#x578B;&#xFF0C;&#x9806;&#x4FBF;&#x505A;&#x500B;&#x6AA2;&#x8A0E;&#xFF1A;</p>
<p><strong>1. &#x8A8D;&#x771F;&#x7814;&#x7A76;&#x578B;&#x7684;&#x6587;&#x7AE0;</strong></p>
<p>&#x300C;<strong>React Query&#x3001;SWR &#x7CFB;&#x5217;</strong>&#x300D;&#x3001;&#x300C;<strong>Builder Pattern</strong>&#x300D;&#x5C6C;&#x65BC;&#x9019;&#x500B;&#x7BC4;&#x7587;&#xFF0C;&#x9019;&#x90E8;&#x5206;&#x7684;&#x6587;&#x7AE0;&#x901A;&#x5E38;&#x662F;&#x5148;&#x6709;&#x4E00;&#x500B;&#x5951;&#x6A5F;&#xFF0C;&#x6BD4;&#x5982;&#x6709;&#x8208;&#x8DA3;&#x7684; library&#x3001;&#x6216;&#x8005;&#x662F;&#x8B80;&#x66F8;&#x6703;&#x7576;&#x4E3B;&#x8B1B;&#x6642;&#x7684;&#x4E3B;&#x984C;&#xFF0C;&#x63A5;&#x8457;&#x518D;&#x6DF1;&#x5165;&#x63A2;&#x7D22;&#x6709;&#x8208;&#x8DA3;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x300C;<strong>React Query&#x3001;SWR &#x7CFB;&#x5217;</strong>&#x300D;&#x5C31;&#x662F;&#x57FA;&#x65BC;&#x6211;&#x5C0D;&#x65BC; cache&#x3001;&#x548C;&#x570D;&#x7E5E; stale-while-revalidate &#x6982;&#x5FF5;&#x7684; code &#x6709;&#x8208;&#x8DA3;&#x800C;&#x63A2;&#x7D22;&#x7684;&#x5167;&#x5BB9;&#xFF1B;&#x300C;<strong>Builder Pattern</strong>&#x300D; &#x5247;&#x662F;&#x5728;&#x8B80;&#x66F8;&#x6703;&#x8AC7;&#x5230; Design Pattern &#x6642;&#x6211;&#x8CA0;&#x8CAC;&#x4E3B;&#x8B1B;&#x7684;&#x5167;&#x5BB9;&#x3002;</p>
<p>&#x9019;&#x90E8;&#x5206;&#x7684;&#x6587;&#x7AE0;&#x6211;&#x89BA;&#x5F97;&#x662F;&#x6700;&#x6709;&#x5E6B;&#x52A9;&#x7684;&#xFF0C;&#x56E0;&#x70BA;&#x901A;&#x5E38;&#x662F;&#x6211;&#x5438;&#x6536;&#x3001;&#x7814;&#x7A76;&#x5F8C;&#x5F97;&#x4F86;&#x7684;&#x5FC3;&#x5F97;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x8A71;&#x4F86;&#x5411;&#x5176;&#x4ED6;&#x4EBA;&#x95E1;&#x8FF0;&#x4EE5;&#x5916;&#xFF0C;&#x5167;&#x5BB9;&#x4E5F;&#x662F;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x523B;&#x7684;&#xFF0C;&#x672A;&#x4F86;&#x60F3;&#x8981; Blog &#x591A;&#x4E00;&#x9EDE;&#x9019;&#x7A2E;&#x6587;&#x7AE0;&#xFF0C;&#x4F46;&#x9019;&#x985E;&#x578B;&#x7684;&#x6587;&#x7AE0;&#x4E0D;&#x597D;&#x7522;&#xFF0C;&#x56E0;&#x70BA;&#x6703;&#x9700;&#x8981;&#x883B;&#x591A;&#x6642;&#x9593;&#x7814;&#x7A76;&#x548C;&#x5438;&#x6536;&#x7684;&#xFF0C;&#x4E00;&#x500B;&#x6708;&#x7522;&#x4E00;&#x7BC7;&#x61C9;&#x8A72;&#x5C31;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x60F9; QQ </p>
<p><strong>2. &#x751F;&#x6D3B;&#x3001;&#x958B;&#x767C;&#x7C21;&#x77ED;&#x65E5;&#x8A8C;</strong></p>
<p>&#x300C;<strong>&#x7B2C;&#x4E00;&#x6B21;&#x958B;&#x6E90;&#x5C31;&#x7DCA;&#x5F35;&#x5230;&#x624B;&#x6296;</strong>&#x300D;&#x3001;&#x300C;<strong>Lidemy &#x6253;&#x96DC;&#x5C0F;&#x5F1F;&#x5FC3;&#x5F97;</strong>&#x300D;&#x3001;&#x300C;<strong>Back Forward Cache</strong>&#x300D;&#x662F;&#x5C6C;&#x65BC;&#x9019;&#x985E;&#x578B;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x901A;&#x5E38;&#x6BD4;&#x8F03;&#x96A8;&#x610F;&#xFF0C;&#x55AE;&#x7D14;&#x662F;&#x5BEB;&#x723D;&#x7684;&#x958B;&#x767C;&#x7D00;&#x9304;&#xFF0C;&#x6240;&#x4EE5;&#x5BEB;&#x8D77;&#x4F86;&#x6700;&#x6C92;&#x6709;&#x58D3;&#x529B;&#x3002;</p>
<p>&#x9019;&#x985E;&#x578B;&#x7684;&#x6587;&#x7AE0;&#x53EF;&#x80FD;&#x5BEB;&#x5B8C;&#x53EA;&#x8A18;&#x5F97;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x6211;&#x5E0C;&#x671B;&#x6BCF;&#x9694;&#x4E00;&#x6BB5;&#x6642;&#x9593;&#x5C31;&#x6703;&#x6709;&#x9019;&#x985E;&#x578B;&#x7684;&#x6587;&#x7AE0;&#x7522;&#x51FA;&#x5566;&#xFF0C;&#x7562;&#x7ADF; Blog &#x9019;&#x7A2E;&#x6587;&#x7AE0;&#x591A;&#x4E00;&#x9EDE;&#x6703;&#x66F4;&#x6709;&#x8DA3;&#xFF0C;&#x4E0D;&#x6703;&#x55AE;&#x7D14;&#x53EA;&#x6709;&#x5F88;&#x786C;&#x7684;&#x6280;&#x8853;&#x6587;&#xFF0C;&#x4E5F;&#x624D;&#x80FD;&#x5920;&#x5F9E;&#x9019;&#x4E9B;&#x65E5;&#x8A8C;&#x77E5;&#x9053;&#x6211;&#x6574;&#x5E74;&#x90FD;&#x505A;&#x4E86;&#x751A;&#x9EBC;&#x3002;</p>
<p><strong>3. &#x7B46;&#x8A18;&#x985E;&#x578B;</strong></p>
<p>&#x5176;&#x4ED6;&#x6C92;&#x63D0;&#x5230;&#x7684;&#x61C9;&#x8A72;&#x90FD;&#x662F;&#x7B46;&#x8A18;&#xFF0C;&#x9019;&#x985E;&#x578B;&#x6BD4;&#x8F03;&#x5C37;&#x5C2C;&#xFF0C;&#x6709;&#x90E8;&#x5206;&#x662F;&#x5982;&#x679C;&#x76F8;&#x95DC;&#x4E3B;&#x984C;&#x6211;&#x5370;&#x8C61;&#x4E0D;&#x6DF1;&#x3001;&#x6BD4;&#x8F03;&#x5C11;&#x7528;&#x5230;&#x7684;&#x8A71;&#xFF0C;&#x5BEB;&#x5B8C;&#x6211;&#x5C31;&#x6703;&#x5FD8;&#x8A18;&#xFF0C;&#x6709;&#x6642;&#x5019;&#x56DE;&#x53BB;&#x7FFB;&#x6587;&#x7AE0;&#x624D;&#x6703;&#x767C;&#x73FE;&#x6B38;&#x5E79;&#x539F;&#x4F86;&#x6211;&#x5BEB;&#x904E;&#x76F8;&#x95DC;&#x7684;&#x7B46;&#x8A18;&#x5594;&#xFF01;</p>
<p>&#x9019;&#x90E8;&#x5206;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x6587;&#x7AE0;&#x6216;&#x55AE;&#x7D14;&#x60F3;&#x5148;&#x653E;&#x4E0A;&#x4F86;&#x7684;&#x5B78;&#x7FD2;&#x7B46;&#x8A18;&#xFF0C;&#x4E4B;&#x5F8C;&#x61C9;&#x8A72;&#x4E5F;&#x6703;&#x591A;&#x653E;&#x4E00;&#x9EDE;&#x9019;&#x7A2E;&#x7B46;&#x8A18;&#xFF0C;&#x4EC0;&#x9EBC;&#x8981;&#x5148;&#x5BEB;&#x597D;&#x624D;&#x80FD;&#x653E;&#x4E0A;&#x4F86;&#x7684;&#x539F;&#x5247;&#x5C31;&#x4E0D;&#x7BA1;&#x4E86;&#xFF0C;&#x5148;&#x653E;&#x4E0A;&#x4F86;&#x518D;&#x8AAA;&#xFF0C;&#x4E0D;&#x904E;&#x6211;&#x9810;&#x8A08;&#x90FD;&#x6703;&#x5728;&#x6A19;&#x984C;&#x52A0;&#x4E0A;&#x300C;&#x7B46;&#x8A18;&#x300D;&#x4E26;&#x4E14;&#x5728;&#x524D;&#x8A00;&#x8B66;&#x544A;&#x5167;&#x5BB9;&#x6703;&#x6709;&#x8AF8;&#x591A;&#x932F;&#x8AA4;&#xFF0C;&#x907F;&#x514D;&#x8AA4;&#x5C0E;&#x4ED6;&#x4EBA;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x8A8D;&#x70BA;&#x9019;&#x662F;&#x64B0;&#x6587;&#x8005;&#x8981;&#x64D4;&#x8CA0;&#x7684;&#x8CAC;&#x4EFB;&#x5566;&#x3002;</p>
<h3 id="2021-&#x4E4B;&#x5F8C;&#x60F3;&#x600E;&#x9EBC;&#x505A;&#xFF1F;"><a href="#2021-&#x4E4B;&#x5F8C;&#x60F3;&#x600E;&#x9EBC;&#x505A;&#xFF1F;" class="headerlink" title="2021 - &#x4E4B;&#x5F8C;&#x60F3;&#x600E;&#x9EBC;&#x505A;&#xFF1F;"></a>2021 - &#x4E4B;&#x5F8C;&#x60F3;&#x600E;&#x9EBC;&#x505A;&#xFF1F;</h3><h4 id="&#x5206;&#x985E;"><a href="#&#x5206;&#x985E;" class="headerlink" title="&#x5206;&#x985E;"></a>&#x5206;&#x985E;</h4><p>2021 &#x6211;&#x60F3;&#x8981;&#x6309;&#x7167;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684; 2020 &#x4E09;&#x7A2E;&#x6587;&#x7AE0;&#x985E;&#x578B;&#x4F86;&#x505A;&#x5206;&#x985E;&#xFF0C;&#x5176;&#x5BE6;&#x73FE;&#x5728;&#x7684;&#x6587;&#x7AE0;&#x90FD;&#x6C92;&#x6309;&#x7167;&#x9019;&#x4E09;&#x7A2E;&#x985E;&#x578B;&#x4F86;&#x5206;&#x985E;&#x5566;&#xFF0C;&#x55AE;&#x7D14;&#x662F;&#x6211;&#x56DE;&#x9867;&#x6642;&#x6B78;&#x7D0D;&#x51FA;&#x4F86;&#x7684;&#x3002;</p>
<p>2021 &#x6BCF;&#x7BC7;&#x6587;&#x90FD;&#x60F3;&#x6309;&#x7167;&#x9019;&#x4E09;&#x7A2E;&#x985E;&#x5225;&#x4F86;&#x5206;&#x985E;&#x3002;&#x7136;&#x5F8C;&#x6587;&#x7AE0;&#x6A19;&#x984C;&#x53EF;&#x80FD;&#x5C31;&#x6703;&#x8B8A;&#x6210; <code>[&#x7B46;&#x8A18;]</code>&#x3001;<code>[&#x6280;&#x8853;]</code>&#x3001;<code>[&#x96DC;&#x8A18;]</code> &#x9019;&#x6A23;&#x4F86;&#x5206;&#x985E;&#xFF0C;&#x597D;&#x5566;&#x6709;&#x9EDE;&#x96E3;&#x5206;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x7B46;&#x8A18;&#x8981;&#x52A0;&#x4E0A; tag&#xFF0C;&#x5206;&#x6E05;&#x695A;&#x54EA;&#x4E9B;&#x662F;&#x6211;&#x96A8;&#x624B;&#x7684;&#x7B46;&#x8A18;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x6211;&#x5438;&#x6536;&#x904E;&#x5F8C;&#x7684;&#x7522;&#x51FA;&#x3002;</p>
<h4 id="&#x4E3B;&#x984C;&#x9810;&#x8A08;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;"><a href="#&#x4E3B;&#x984C;&#x9810;&#x8A08;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;" class="headerlink" title="&#x4E3B;&#x984C;&#x9810;&#x8A08;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;"></a>&#x4E3B;&#x984C;&#x9810;&#x8A08;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;</h4><p>&#x9019;&#x908A;&#x6307;&#x7684;&#x662F;&#x300C;&#x7814;&#x7A76;&#x985E;&#x578B;&#x300D;&#x7684;&#x6587;&#x7AE0;&#x5206;&#x985E;&#x3002;</p>
<ol>
<li><strong>XState</strong></li>
<li><strong>Functional Programming</strong></li>
<li>CS &#x7684;&#x57FA;&#x790E;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x9EDE;&#x9EDE;&#x7684; <strong>Data Structure</strong> &#x548C; <strong>Algorithm</strong></li>
<li>&#x5176;&#x4ED6;&#x9084;&#x6C92;&#x60F3;&#x5230;&#xFF0C;&#x4F46;&#x6211;&#x89BA;&#x5F97;&#x4E0A;&#x9762;&#x5C31;&#x5920;&#x6211;&#x7814;&#x7A76;&#x60F9;</li>
</ol>
<p>&#x9019;&#x4E9B;&#x90FD;&#x53EA;&#x662F;&#x9810;&#x8A08;&#x5566;&#xFF0C;&#x6703;&#x9078; XState &#x548C; Functional Programming &#x662F;&#x500B;&#x4EBA;&#x504F;&#x597D;&#xFF0C;&#x800C;&#x4E14;&#x61C9;&#x8A72;&#x6703;&#x66F4;&#x6CE8;&#x91CD;&#x5728; Functional Programming&#xFF0C;&#x56E0;&#x70BA;&#x6700;&#x8FD1;&#x89BA;&#x5F97;&#x633A;&#x6709;&#x8DA3;&#x7684;&#xFF1B;Data Structure &#x548C; Algorithm &#x5247;&#x662F;&#x8A8D;&#x70BA;&#x81EA;&#x5DF1;&#x5F88;&#x7F3A;&#x5C11;&#x7684;&#x77E5;&#x8B58;&#xFF0C;&#x60F3;&#x8981;&#x627E;&#x6642;&#x9593;&#x88DC;&#x9F4A;&#x3002;</p>
<h2 id="&#x5C0D;&#x65BC;&#x5BEB;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x6709;&#x600E;&#x9EBC;&#x6A23;&#x7684;&#x9AD4;&#x6703;&#xFF1F;"><a href="#&#x5C0D;&#x65BC;&#x5BEB;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x6709;&#x600E;&#x9EBC;&#x6A23;&#x7684;&#x9AD4;&#x6703;&#xFF1F;" class="headerlink" title="&#x5C0D;&#x65BC;&#x5BEB;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x6709;&#x600E;&#x9EBC;&#x6A23;&#x7684;&#x9AD4;&#x6703;&#xFF1F;"></a>&#x5C0D;&#x65BC;&#x5BEB;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x6709;&#x600E;&#x9EBC;&#x6A23;&#x7684;&#x9AD4;&#x6703;&#xFF1F;</h2><p>&#x4E8B;&#x767C;&#x5728;&#x67D0;&#x5929;&#x9A0E;&#x8ECA;&#x7684;&#x9748;&#x5149;&#x4E00;&#x73FE;&#xFF0C;&#x90A3;&#x6642;&#x5019;&#x5728;&#x56DE;&#x60F3;&#x6211; 2020 &#x5BEB;&#x4E86;&#x54EA;&#x4E9B;&#x6587;&#x7AE0;&#xFF0C;&#x60F3;&#x8457;&#x54EA;&#x4E9B;&#x6587;&#x7AE0;&#x5BEB;&#x5B8C;&#x6703;&#x89BA;&#x5F97;&#x6700;&#x6709;&#x6210;&#x9577;&#xFF1F;&#x800C;&#x9019;&#x4E9B;&#x6587;&#x7AE0;&#x6709;&#x751A;&#x9EBC;&#x5171;&#x901A;&#x9EDE;&#xFF1F;</p>
<p>&#x60F3;&#x8457;&#x60F3;&#x8457;&#x767C;&#x73FE;&#xFF0C;&#x6B38;&#x9760;&#xFF0C;&#x6211;&#x6700;&#x80FD;&#x5920;&#x6574;&#x7406;&#x601D;&#x7DD2;&#x3001;&#x5BEB;&#x51FA;&#x66F4;&#x597D;&#x6587;&#x7AE0;&#x7684;&#x6642;&#x6A5F;&#x9EDE;&#x662F;&#x300C;<strong>&#x7576;&#x6211;&#x8981;&#x8B1B;&#x89E3;&#x7D66;&#x5176;&#x4ED6;&#x4EBA;&#x807D;&#x7684;&#x6642;&#x5019;</strong>&#x300D;&#xFF0C;&#x6BD4;&#x5982; &#x300C;<strong>React Query&#x3001;SWR</strong>&#x300D;&#x662F;&#x6211;&#x5728;&#x8B80;&#x66F8;&#x6703;&#x8981;&#x8B1B;&#x89E3;&#x6700;&#x8FD1;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x8853;&#x6642;&#x5BEB;&#x51FA;&#x4F86;&#x7684;&#xFF0C;&#x904E;&#x7A0B;&#x662F;&#x5148;&#x6574;&#x7406;&#x51FA;&#x4E86;&#x7C21;&#x5831;&#xFF0C;&#x8B1B;&#x89E3;&#x7D66;&#x5176;&#x4ED6;&#x4EBA;&#x807D;&#x4E4B;&#x5F8C;&#xFF0C;&#x518D;&#x5BEB;&#x6210;&#x6587;&#x7AE0;&#xFF1B;&#x300C;<strong>Builder Patter</strong>&#x300D;&#x4E00;&#x6A23;&#x4E5F;&#x662F;&#x60F3;&#x8B1B;&#x89E3;&#x7D66;&#x4ED6;&#x4EBA;&#x4E86;&#x89E3;&#x9019;&#x500B;&#x6A21;&#x5F0F;&#x5F8C;&#x5BEB;&#x51FA;&#x4F86;&#x7684;&#x3002;</p>
<p>&#x7576;&#x7406;&#x89E3;&#x300C;&#x6211;&#x80FD;&#x5920;&#x5BEB;&#x597D;&#x6587;&#x7AE0;&#x7684;&#x6642;&#x6A5F;&#x300D;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x6211;&#x8D85;&#x958B;&#x5FC3;&#x7684;&#xFF01;&#x81F3;&#x5C11;&#x6709;&#x500B;&#x65B9;&#x5411;&#x628A;&#x6587;&#x7AE0;&#x5BEB;&#x597D;&#x4E86;&#xFF0C;2020 &#x5927;&#x90E8;&#x5206;&#x6642;&#x9593;&#x5BEB;&#x6587;&#x7AE0;&#x6642;&#x90FD;&#x6709;&#x9EDE;&#x8FF7;&#x832B;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x6A23;&#x52D5;&#x7B46;&#x624D;&#x597D;&#xFF0C;&#x5728;&#x5E74;&#x5C3E;&#x7684;&#x6642;&#x5019;&#x627E;&#x5230;&#x4E00;&#x9EDE;&#x65B9;&#x5411;&#x771F;&#x7684;&#x662F;&#x8B9A; &#x1F44D; &#x672A;&#x4F86;&#x61C9;&#x8A72;&#x4E5F;&#x6703;&#x8A66;&#x8A66;&#x770B;&#x7528;&#x9019;&#x500B;&#x65B9;&#x5F0F;&#x4F86;&#x5275;&#x4F5C;&#x6587;&#x7AE0;&#x3002;</p>
<h2 id="2020-&#x6211;&#x7814;&#x7A76;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;&#x6368;&#x68C4;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;"><a href="#2020-&#x6211;&#x7814;&#x7A76;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;&#x6368;&#x68C4;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;" class="headerlink" title="2020 &#x6211;&#x7814;&#x7A76;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;&#x6368;&#x68C4;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;"></a>2020 &#x6211;&#x7814;&#x7A76;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;&#x6368;&#x68C4;&#x4E86;&#x54EA;&#x4E9B;&#x6771;&#x897F;&#xFF1F;</h2><h3 id="React&#x3001;Storybook"><a href="#React&#x3001;Storybook" class="headerlink" title="React&#x3001;Storybook"></a>React&#x3001;Storybook</h3><ul>
<li><strong><a href="https://frontendmasters.com/courses/intermediate-react-v2/" target="_blank" rel="noopener">Intermediate React, v2</a></strong></li>
</ul>
<p>&#x4E2D;&#x968E; React &#x8AB2;&#x7A0B;&#xFF0C;&#x91CD;&#x65B0;&#x719F;&#x6089;&#x5404;&#x7A2E; hooks&#x3001;&#x63A5;&#x89F8;&#x6E2C;&#x8A66;&#x3001;API mocking &#x4E4B;&#x985E;&#x7684;&#xFF0C;&#x9019;&#x8AB2;&#x7A0B;&#x5C0D;&#x6211;&#x6700;&#x5927;&#x7684;&#x5E6B;&#x52A9;&#x662F;&#x521D;&#x6B21;&#x63A5;&#x89F8; TypeScript&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x9EDE;&#x5C0D; TypeScript &#x7684;&#x719F;&#x6089;&#x611F;&#x3002;</p>
<ul>
<li><strong><a href="https://www.books.com.tw/products/0010870186" target="_blank" rel="noopener">&#x5F9E; Hooks &#x958B;&#x59CB;&#xFF0C;&#x8B93;&#x4F60;&#x7684;&#x7DB2;&#x9801; React &#x8D77;&#x4F86;</a></strong></li>
</ul>
<p>&#x9019;&#x672C;&#x66F8;&#x9762;&#x5411; React &#x521D;&#x5B78;&#x8005;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;</p>
<ul>
<li><strong><a href="https://frontendmasters.com/courses/#my" target="_blank" rel="noopener">Design Systems with React &amp; Storybook</a></strong></li>
</ul>
<p>&#x4E0A;&#x4E86; 70%&#xFF0C;&#x4E00;&#x958B;&#x59CB;&#x662F;&#x55AE;&#x7D14;&#x6709;&#x8208;&#x8DA3;&#xFF0C;&#x5F8C;&#x4F86;&#x767C;&#x73FE;&#x5B78;&#x4E86;&#x4E0D;&#x77E5;&#x9053;&#x7528;&#x5728;&#x54EA;&#xFF0C;&#x5C31;&#x5148;&#x653E;&#x8457;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x8FD1;&#x516C;&#x53F8;&#x5C08;&#x6848;&#x958B;&#x59CB;&#x6709;&#x9019;&#x500B;&#x9700;&#x6C42;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD1;&#x671F;&#x6709;&#x53EF;&#x80FD;&#x6703;&#x628A;&#x5B83;&#x770B;&#x5B8C;&#x7136;&#x5F8C;&#x4ECB;&#x7D39;&#x7D66;&#x5176;&#x4ED6;&#x540C;&#x4E8B;&#x3002;</p>
<h3 id="XState"><a href="#XState" class="headerlink" title="XState"></a>XState</h3><ul>
<li><strong>&#x770B;&#x4E86; <a href="https://frontendmasters.com/courses/xstate/" target="_blank" rel="noopener">State Machines in JavaScript with XState</a>&#x3001;<a href="https://frontendmasters.com/workshops/xstate-react/" target="_blank" rel="noopener">State Modeling with React and XState with David Khourshid</a></strong></li>
</ul>
<p>&#x5F88;&#x559C;&#x6B61; XState &#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x7528;&#x904E;&#x6709;&#x9EDE;&#x56DE;&#x4E0D;&#x53BB;&#x60F9;&#xFF0C;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x4E0A;&#x6C92;&#x554F;&#x984C;&#xFF0C;&#x4F46;&#x5C0D;&#x65BC;&#x66F4;&#x5927;&#x898F;&#x6A21;&#x7684; project &#x5982;&#x4F55;&#x898F;&#x5283;&#x3001;machine &#x600E;&#x9EBC;&#x5207;&#x5206;&#x9084;&#x6C92;&#x6709;&#x500B;&#x6982;&#x5FF5;&#xFF0C;&#x5BE6;&#x4F5C;&#x4E0A;&#x6703;&#x6709;&#x9EDE;&#x7121;&#x52A9;&#xFF0C;&#x6240;&#x4EE5;&#x8FD1;&#x671F;&#x60F3;&#x5BEB;&#x5E7E;&#x7BC7;&#x6587;&#x7AE0;&#x548C;&#x5C0F; project &#x4F86;&#x4ECB;&#x7D39;&#x548C;&#x73A9;&#x73A9;&#x5B83;&#xFF0C;&#x589E;&#x52A0;&#x719F;&#x6089;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<h3 id="Functional-Programming"><a href="#Functional-Programming" class="headerlink" title="Functional Programming"></a>Functional Programming</h3><ul>
<li><strong><a href="https://github.com/MostlyAdequate/mostly-adequate-guide" target="_blank" rel="noopener">mostly-adequate-guide</a> &#x770B;&#x5230;&#x7B2C;&#x4E5D;&#x7AE0;</strong></li>
</ul>
<p>&#x524D;&#x9762;&#x5E7E;&#x7AE0;&#x9084;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x5230;&#x4E86; Functor &#x7684;&#x7AE0;&#x7BC0;&#x6709;&#x9EDE;&#x982D;&#x660F;&#x8166;&#x8139;&#xFF0C;&#x89BA;&#x5F97; FP &#x9817;&#x96E3;&#xFF0C;&#x770B;&#x4F86;&#x9084;&#x6C92;&#x958B;&#x7AC5;&#x6B38;&#x55DA;&#x55DA;</p>
<ul>
<li><strong><a href="https://frontendmasters.com/courses/functional-javascript-v3/" target="_blank" rel="noopener">Functional-Light JavaScript, v3</a></strong></li>
</ul>
<p>&#x770B;&#x5230; Function Purity &#x7AE0;&#x7BC0;&#xFF0C;&#x706B;&#x71B1;&#x9032;&#x884C;&#x4E2D;&#xFF01;&#x76EE;&#x524D;&#x611F;&#x60F3;&#x662F; Kyle &#x628A;&#x6BCF;&#x500B;&#x7D30;&#x7BC0;&#x90FD;&#x8B1B;&#x5F97;&#x5F88;&#x5B8C;&#x6574;&#xFF0C;&#x5FC5;&#x9808;&#x8981;&#x591A;&#x82B1;&#x597D;&#x5E7E;&#x500D;&#x7684;&#x6642;&#x9593;&#x7814;&#x7A76;&#xFF1B;&#x518D;&#x8005;&#x662F;&#x56E0;&#x70BA;&#x5167;&#x5BB9;&#x592A;&#x591A;&#xFF0C;&#x6709;&#x6642;&#x5019;&#x4E0D;&#x61C2;&#x4ED6;&#x771F;&#x6B63;&#x60F3;&#x8868;&#x9054;&#x7684;&#x610F;&#x601D;&#x3002;</p>
<p>FP &#x4E4B;&#x8DEF;&#x4F3C;&#x4E4E;&#x6709;&#x9EDE;&#x8271;&#x8F9B;&#xFF0C;&#x6211;&#x6703;&#x52AA;&#x529B; der&#x3002;</p>
<ul>
<li><strong><a href="https://egghead.io/lessons/javascript-refactoring-imperative-code-to-a-single-composed-expression-using-box" target="_blank" rel="noopener">Professor Frisby Introduces Composable Functional JavaScript</a></strong></li>
</ul>
<p>&#x7528;&#x5361;&#x901A;&#x4EBA;&#x7269;&#x7684;&#x8A9E;&#x6C23;&#x8B1B;&#x8AB2;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x7FD2;&#x6163; XDD &#x800C;&#x4E14;&#x7BC0;&#x594F;&#x504F;&#x5FEB;&#xFF0C;&#x89BA;&#x5F97;&#x73FE;&#x968E;&#x6BB5;&#x7684;&#x81EA;&#x5DF1;&#x9084;&#x9700;&#x8981;&#x66F4;&#x591A; FP &#x57FA;&#x790E;&#x624D;&#x6709;&#x8FA6;&#x6CD5;&#x807D;&#x61C2;&#xFF0C;&#x6240;&#x4EE5;&#x7B49; Functional-Light JavaScript &#x518D;&#x8003;&#x616E;&#x8981;&#x4E0D;&#x8981;&#x7E7C;&#x7E8C;&#x770B;&#x3002;</p>
<h3 id="OOP"><a href="#OOP" class="headerlink" title="OOP"></a>OOP</h3><ul>
<li><strong><a href="https://refactoringguru.cn/design-patterns/book" target="_blank" rel="noopener">&#x6DF1;&#x5165;&#x8A2D;&#x8A08;&#x6A21;&#x5F0F;</a> &#x770B;&#x4E86;&#x5DE5;&#x5EE0;&#x6A21;&#x5F0F;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5EE0;&#x3001;&#x751F;&#x6210;&#x5668;</strong></li>
</ul>
<p>&#x81EA;&#x5DF1;&#x5BE6;&#x969B;&#x6709;&#x770B;&#x7684;&#x7AE0;&#x7BC0;&#x662F;&#x5DE5;&#x5EE0;&#x6A21;&#x5F0F;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5EE0;&#x3001;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x807D;&#x5176;&#x4ED6;&#x4EBA;&#x8B1B;&#x89E3;&#x7684;&#x662F;&#x8CAC;&#x4EFB;&#x93C8;&#x548C;&#x547D;&#x4EE4;&#x6A21;&#x5F0F;&#xFF0C;&#x611F;&#x60F3;&#x662F;&#x7F3A;&#x5C11;&#x4E86;&#x5BE6;&#x969B;&#x7684; OOP &#x61C9;&#x7528;&#x7684;&#x8A71;&#xFF0C;&#x8B80;&#x8A2D;&#x8A08;&#x6A21;&#x5F0F;&#x61C9;&#x8A72;&#x8D85;&#x5BB9;&#x6613;&#x5FD8;&#x8A18;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x81EA;&#x5DF1;&#x6709;&#x5BE6;&#x969B;&#x7814;&#x7A76;&#x3001;&#x95B1;&#x8B80;&#x7684; pattern &#x9084;&#x7B97;&#x80FD;&#x5920;&#x8A18;&#x5F97;&#xFF0C;&#x55AE;&#x7D14;&#x807D;&#x5225;&#x4EBA;&#x8B1B;&#x89E3;&#x7684;&#x8D85;&#x5FEB;&#x5C31;&#x6703;&#x5FD8;&#x6389;&#x3002;</p>
<h3 id="Udemy-&#x5176;&#x4ED6;&#x8AB2;&#x7A0B;"><a href="#Udemy-&#x5176;&#x4ED6;&#x8AB2;&#x7A0B;" class="headerlink" title="Udemy &#x5176;&#x4ED6;&#x8AB2;&#x7A0B;"></a>Udemy &#x5176;&#x4ED6;&#x8AB2;&#x7A0B;</h3><ul>
<li><strong><a href="https://www.udemy.com/course/the-complete-junior-to-senior-web-developer-roadmap/" target="_blank" rel="noopener">The Complete Junior to Senior Web Developer Roadmap</a> &#x770B;&#x5230;&#x7B2C;&#x4E09;&#x7AE0;&#x653E;&#x68C4;</strong></li>
</ul>
<p>&#x767C;&#x73FE;&#x81EA;&#x5DF1;&#x73FE;&#x968E;&#x6BB5;&#x4E0D;&#x9069;&#x5408;&#x9019;&#x7A2E;&#x5927;&#x96DC;&#x71F4;&#x7684; roadmap&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x89BA;&#x5F97;&#x4EC0;&#x9EBC;&#x90FD;&#x807D;&#x4E86;&#xFF0C;&#x4F46;&#x4EC0;&#x9EBC;&#x90FD;&#x53EA;&#x61C2;&#x4E00;&#x9EDE;&#x9EDE;&#x4F3C;&#x4E4E;&#x6C92;&#x592A;&#x5927;&#x7528;&#x8655;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x6642;&#x6578;&#x5BE6;&#x5728;&#x662F;&#x592A;&#x9577;&#x60F9;&#xFF0C;&#x5149;&#x662F;&#x6253;&#x958B;&#x58D3;&#x529B;&#x5C31;&#x597D;&#x5927;&#x3002;</p>
<p>&#x6211;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x4F3C;&#x4E4E;&#x6BD4;&#x8F03;&#x9069;&#x5408;&#x55AE;&#x4E00;&#x4E3B;&#x984C;&#x7684;&#x8AB2;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982; FP &#x5C31;&#x5C08;&#x6CE8;&#x8B1B; FP&#xFF1B;React &#x5C31;&#x5C08;&#x5FC3;&#x8B1B; React&#xFF0C;&#x4EC0;&#x9EBC;&#x90FD;&#x8B1B;&#x4E00;&#x9EDE;&#x7684;&#x6211;&#x6703;&#x6709;&#x9EDE;&#x6C92;&#x8010;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x6709;&#x80A1;&#x6C92;&#x5B78;&#x9032;&#x53BB;&#x7684;&#x4E0D;&#x5B89;&#x5168;&#x611F;&#x3002;</p>
<h2 id="&#x7D50;&#x8A9E;"><a href="#&#x7D50;&#x8A9E;" class="headerlink" title="&#x7D50;&#x8A9E;"></a>&#x7D50;&#x8A9E;</h2><p>&#x6211;&#x89BA;&#x5F97;&#x81EA;&#x5DF1;&#x5728; 2020 &#x4E0D;&#x6703;&#x5F88;&#x6DF7;&#xFF0C;&#x9084;&#x7B97;&#x8A8D;&#x771F;&#xFF0C;&#x4E0B;&#x73ED;&#x6642;&#x9593;&#x6216;&#x9031;&#x672B;&#x90FD;&#x6703;&#x7814;&#x7A76;&#x81EA;&#x5DF1;&#x611F;&#x8208;&#x8DA3;&#x7684;&#x6771;&#x897F;&#xFF0C;&#x4F46;&#x95DC;&#x65BC;&#x6210;&#x679C;&#xFF0C;&#x6709;&#x6C92;&#x6709;&#x5F88;&#x597D;&#x6211;&#x4E0D;&#x78BA;&#x5B9A;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x6642;&#x9593;&#x90FD;&#x662F;&#x5728;&#x4E0D;&#x505C;&#x63A2;&#x7D22;&#xFF0C;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x5B78;&#x7FD2;&#x3001;&#x5982;&#x4F55;&#x5728; Lidemy &#x8AB2;&#x7A0B;&#x7562;&#x696D;&#x5F8C;&#x6301;&#x7E8C;&#x6210;&#x9577;&#x3001;&#x63A2;&#x7D22;&#x81EA;&#x5DF1;&#x559C;&#x6B61;&#x54EA;&#x4E9B;&#x6280;&#x8853;&#x3001;&#x63A2;&#x7D22;&#x5BEB;&#x6587;&#x3001;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x7576;&#x500B;&#x597D;&#x52A9;&#x6559;&#x3002;</p>
<p>&#x9019;&#x9663;&#x5B50;&#x5B78;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x767C;&#x73FE;&#x7576;&#x6211;&#x8981;&#x8B1B;&#x89E3;&#x7D66;&#x4ED6;&#x4EBA;&#x807D;&#x67D0;&#x500B;&#x6982;&#x5FF5;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x56E0;&#x70BA;&#x6015;&#x5176;&#x4ED6;&#x4EBA;&#x807D;&#x4E0D;&#x61C2;&#x3001;&#x6015;&#x5C0D;&#x65B9;&#x6703;&#x5931;&#x671B;&#x7B49;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x9019;&#x6642;&#x6703;&#x662F;&#x81EA;&#x5DF1;&#x6700;&#x8A8D;&#x771F;&#x7814;&#x7A76;&#x3001;&#x7814;&#x7A76;&#x6700;&#x900F;&#x5FB9;&#x7684;&#x6642;&#x5019;&#xFF0C;&#x56E0;&#x70BA;&#x767C;&#x73FE;&#x4E86;&#x9019;&#x9EDE;&#xFF0C;&#x6211;&#x5C31;&#x53BB;&#x53C3;&#x52A0;&#x6216;&#x88FD;&#x9020;&#x4E86;&#x5E7E;&#x500B;&#x9700;&#x8981;&#x53E3;&#x982D;&#x8B1B;&#x89E3;&#x6280;&#x8853;&#x7684;&#x5834;&#x5408;&#xFF0C;&#x6BD4;&#x5982; Lidemy &#x52A9;&#x6559;&#x7FA4;&#x8B80;&#x66F8;&#x6703;&#x3001;&#x8209;&#x8FA6;&#x516C;&#x53F8;&#x7684;&#x8B80;&#x66F8;&#x6703;&#x7B49;&#x7B49;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x9019;&#x4E9B;&#x5834;&#x5408;&#x7576;&#x4E3B;&#x8B1B;&#x7684;&#x4E3B;&#x984C;&#xFF0C;&#x6211;&#x6703;&#x7814;&#x7A76;&#x7684;&#x883B;&#x958B;&#x5FC3;&#x7684;&#xFF0C;&#x4E5F;&#x6703;&#x56E0;&#x6B64;&#x5B78;&#x5230;&#x4E0D;&#x5C11;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4EF6;&#x4E8B;&#x662F;&#x8DDF;&#x96A8;&#x8457;&#x4E0A;&#x4E00;&#x4EF6;&#x4E8B;&#x800C;&#x589E;&#x52A0;&#x7684;&#x6280;&#x80FD;&#xFF0C;&#x5C31;&#x662F;&#x53E3;&#x982D;&#x8868;&#x9054;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x96D6;&#x7136;&#x6709;&#x6642;&#x5019;&#x9084;&#x662F;&#x6703;&#x8A9E;&#x901F;&#x592A;&#x5FEB;&#xFF0C;&#x6216;&#x5361;&#x5230;&#x7206;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x4F9B;&#x4E09;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x5920;&#x597D;&#x597D;&#x7D44;&#x7E54;&#x8A9E;&#x8A00;&#x3001;&#x628A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x8B1B;&#x5F97;&#x6E05;&#x6670;&#x7684;&#x80FD;&#x529B;&#x6709;&#x883B;&#x660E;&#x986F;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x73FE;&#x5728;&#x4E5F;&#x61C2;&#x7684;&#x9069;&#x6642;&#x8ABF;&#x6574;&#x901F;&#x5EA6;&#x8B93;&#x5927;&#x5BB6;&#x90FD;&#x5C0D;&#x4E0A;&#x540C;&#x500B;&#x983B;&#x7387;&#xFF0C;&#x5C0D;&#x65BC;&#x628A;&#x8A71;&#x8A9E;&#x7684;&#x67B6;&#x69CB;&#x597D;&#x597D;&#x7D44;&#x7E54;&#x9019;&#x4EF6;&#x4E8B;&#x6709;&#x63D0;&#x5347;&#x4E00;&#x500B;&#x5C64;&#x6B21;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x662F;&#x767C;&#x73FE;&#x81EA;&#x5DF1;&#x7684;&#x8A5E;&#x5F59;&#x91CF;&#x6709;&#x5920;&#x5C11;&#xFF0C;&#x5BEB;&#x6587;&#x5197;&#x8A5E;&#x8D05;&#x5B57;&#x4E5F;&#x633A;&#x591A;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x4E00;&#x9EDE;&#x66F8;&#x7C4D;&#x7684;&#x8A5E;&#x5F59;&#x8F38;&#x5165;&#xFF0C;&#x624D;&#x80FD;&#x6709;&#x6BD4;&#x8F03;&#x591A;&#x5143;&#x7684;&#x8F38;&#x51FA;&#x3002;</p>
<p>&#x7E3D;&#x7684;&#x4F86;&#x8AAA;&#xFF0C;&#x5C31;&#x662F;&#x6211; 2021 &#x6703;&#x7E7C;&#x7E8C;&#x52A0;&#x6CB9;&#x5587;&#xFF0C;&#x611F;&#x8B1D;&#x4E00;&#x8DEF;&#x5E6B;&#x52A9;&#x6211;&#x7684;&#x5404;&#x4F4D;&#x5927;&#x5927;&#x3002;</p>
</body></html>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/%E5%BB%A2%E6%96%87%E6%97%A5%E8%A8%98/">#廢文日記</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop is-hidden-mobile article-nav-prev">
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2021/01/02/builder-pattern/">Builder Pattern（生成器）</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type='text/javascript' src='https://platform-api.sharethis.com/js/sharethis.js#property=5e4221ec7a88780012e1744e&amp;product=inline-share-buttons' async='async'></script>

</div>



<div class="comments">
    <h3 class="title is-4">Comments</h3>
    
<script>
    var disqus_config = function () {
        this.page.url = 'https://chihyang41.github.io/2021/01/02/2020-review/';
        this.page.identifier = '2021/01/02/2020-review/';
        
        this.language = 'en';
        
    };
    (function() {
        var d = document, s = d.createElement('script');  
        s.src = '//' + 'ChihYang41-blog' + '.disqus.com/embed.js';
        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>

<div id="disqus_thread">
    
    <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript" target="_blank" rel="noopener">comments powered by Disqus.</a></noscript>
</div>
</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2021 Chih Yang&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank">Hexo</a> & <a
                        href="http://github.com/ppoffice/hexo-theme-minos">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ChihYang41" target="_blank" rel="noopener">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" target="_blank" rel="noopener">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("en-AU");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    



<script src="/js/script.js"></script>


    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Type something..." />
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Posts',
                PAGES: 'Pages',
                CATEGORIES: 'Categories',
                TAGS: 'Tags',
                UNTITLED: '(Untitled)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>

<script src="/js/insight.js"></script>

    
</body>
</html>